nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt685/multiprocessor_examples/erpc_server_matrix_multiply_spi/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name HS_SPI_SCK (coord L2), U19[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA0_PERIPHERAL FLEXCOMM14 /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA0_SIGNAL SCK            /*!<@brief Signal name */
                                                          /* @} */

/*! @name HS_SPI_MISO (coord M2), U19[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA1_PERIPHERAL FLEXCOMM14 /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA1_SIGNAL MISO           /*!<@brief Signal name */
                                                          /* @} */

/*! @name HS_SPI_MOSI (coord N1), U19[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA2_PERIPHERAL FLEXCOMM14 /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA2_SIGNAL MOSI           /*!<@brief Signal name */
                                                          /* @} */

/*! @name PIO1_16 (coord M4), SW5-5/JP13[1]/ISP1
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_SIGNAL PIO1
/*!
 * @brief Signal channel */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_CHANNEL 16

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_GPIO_PIN_MASK (1U << 16U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_BRIDGE_INTR_ISP_PIN_MASK (1U << 16U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
